##**Other Pandas Functionalities**

###Demo: Analysis of the titanic dataset


**Features' Description:**

>survival:	Survival

>pclass:	Ticket class

>sex:	Sex

>Age:	Age in years

>sibsp:	Number of siblings / spouses aboard the Titanic	

>parch:	Number of parents / children aboard the Titanic	

>ticket:	Ticket number	

>fare:	Passenger fare	

>cabin:	Cabin number

>embarked:	Port of Embarkation

In [1]:
# read a csv file
# You can read different type of files in pandas DataFrame like,
#  read_excel(), read_json(), read_html(), read_sql(), read_pickle()
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.head() #display first 5 rows

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [2]:
print(df['Survived'].value_counts()) #value_counts() method returns the frequency of each value
df['Sex'].unique() #returns the unique values in the dataset

0    549
1    342
Name: Survived, dtype: int64

array(['male', 'female'], dtype=object)

In [3]:
df['Survived'] #Selecting a column
df[['Survived','Pclass','Age']] #Selecting multiple columns

     Survived  Pclass   Age
0           0       3  22.0
1           1       1  38.0
2           1       3  26.0
3           1       1  35.0
4           0       3  35.0
..        ...     ...   ...
886         0       2  27.0
887         1       1  19.0
888         0       3   NaN
889         1       1  26.0
890         0       3  32.0

[891 rows x 3 columns]

In [4]:
df["Fare"].max(), df["Fare"].min()

(512.3292, 0.0)

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
#Creating a new column
df['normalized_fare'] = df['Fare']/100
df.head(2)

   PassengerId  Survived  Pclass  ... Cabin Embarked  normalized_fare
0            1         0       3  ...   NaN        S         0.072500
1            2         1       1  ...   C85        C         0.712833

[2 rows x 13 columns]

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'normalized_fare'],
      dtype='object')

In [8]:
df.dtypes #data-types of each column

PassengerId          int64
Survived             int64
Pclass               int64
Name                object
Sex                 object
Age                float64
SibSp                int64
Parch                int64
Ticket              object
Fare               float64
Cabin               object
Embarked            object
normalized_fare    float64
dtype: object

In [9]:
df.info() #Printing the info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PassengerId      891 non-null    int64
 1   Survived         891 non-null    int64
 2   Pclass           891 non-null    int64
 3   Name             891 non-null    object
 4   Sex              891 non-null    object
 5   Age              714 non-null    float64
 6   SibSp            891 non-null    int64
 7   Parch            891 non-null    int64
 8   Ticket           891 non-null    object
 9   Fare             891 non-null    float64
 10  Cabin            204 non-null    object
 11  Embarked         889 non-null    object
 12  normalized_fare  891 non-null    float64
dtypes: float64(3), int64(5), object(5)
memory usage: 90.6+ KB

In [10]:
import numpy as np
#Selecting columns with mentioned data-types
num_df = df.select_dtypes(include=[np.number])
num_df.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare  normalized_fare
0            1         0       3  22.0      1      0   7.2500         0.072500
1            2         1       1  38.0      1      0  71.2833         0.712833
2            3         1       3  26.0      0      0   7.9250         0.079250
3            4         1       1  35.0      1      0  53.1000         0.531000
4            5         0       3  35.0      0      0   8.0500         0.080500

###**Exploring Descriptive Analytics**

In [11]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [12]:
print('The average age of all passengers',df['Age'].mean())
print('The standard deviation of column "Age" of all passengers',df['Age'].std())

The average age of all passengers 29.69911764705882
The standard deviation of column "Age" of all passengers 14.526497332334044

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PassengerId      891 non-null    int64
 1   Survived         891 non-null    int64
 2   Pclass           891 non-null    int64
 3   Name             891 non-null    object
 4   Sex              891 non-null    object
 5   Age              714 non-null    float64
 6   SibSp            891 non-null    int64
 7   Parch            891 non-null    int64
 8   Ticket           891 non-null    object
 9   Fare             891 non-null    float64
 10  Cabin            204 non-null    object
 11  Embarked         889 non-null    object
 12  normalized_fare  891 non-null    float64
dtypes: float64(3), int64(5), object(5)
memory usage: 90.6+ KB

In [14]:
df.describe()

       PassengerId    Survived  ...        Fare  normalized_fare
count   891.000000  891.000000  ...  891.000000       891.000000
mean    446.000000    0.383838  ...   32.204208         0.322042
std     257.353842    0.486592  ...   49.693429         0.496934
min       1.000000    0.000000  ...    0.000000         0.000000
25%     223.500000    0.000000  ...    7.910400         0.079104
50%     446.000000    0.000000  ...   14.454200         0.144542
75%     668.500000    1.000000  ...   31.000000         0.310000
max     891.000000    1.000000  ...  512.329200         5.123292

[8 rows x 8 columns]

In [15]:
 #correlation among different features
 df.corr()

                 PassengerId  Survived  ...      Fare  normalized_fare
PassengerId         1.000000 -0.005007  ...  0.012658         0.012658
Survived           -0.005007  1.000000  ...  0.257307         0.257307
Pclass             -0.035144 -0.338481  ... -0.549500        -0.549500
Age                 0.036847 -0.077221  ...  0.096067         0.096067
SibSp              -0.057527 -0.035322  ...  0.159651         0.159651
Parch              -0.001652  0.081629  ...  0.216225         0.216225
Fare                0.012658  0.257307  ...  1.000000         1.000000
normalized_fare     0.012658  0.257307  ...  1.000000         1.000000

[8 rows x 8 columns]

NameError: ignored